app/views/songs/index.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
<% @songs.each do |song| %>
  <% if !song.artist.present? %>