app/views/songs/show.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  <h1><%= @song.title %></h1>
<% if !@song.artist.present? %>